# Task 5: SQL-based Analysis of Product Sales

In [1]:
import pandas as pd
import sqlite3

# Connect to the Chinook database
conn = sqlite3.connect("./Chinook.sqlite")

## 1. Top-Selling Products
We want to find the top 10 products (tracks) with the highest sales in terms of quantity sold.

In [2]:
query_top_selling_product = """
SELECT t.Name AS Track, SUM(ivl.Quantity) AS TotalSold
FROM InvoiceLine ivl
JOIN Track t ON ivl.TrackId = t.TrackId
GROUP BY t.Name
ORDER BY TotalSold DESC
LIMIT 10;
"""
df1 = pd.read_sql_query(query_top_selling_product, conn)
df1

                       Track  TotalSold
0                The Trooper          5
1                   Untitled          4
2    The Number Of The Beast          4
3        Sure Know Something          4
4       Hallowed Be Thy Name          4
5                   Eruption          4
6          Where Eagles Dare          3
7  Welcome Home (Sanitarium)          3
8             Sweetest Thing          3
9                  Surrender          3

## 2. Revenue per Region
We calculate total revenue grouped by **billing country** (region).

In [3]:
query_revenue_per_region = """
SELECT BillingCountry AS Region, SUM(Total) AS TotalRevenue
FROM Invoice
GROUP BY BillingCountry
ORDER BY TotalRevenue DESC;
"""
df2 = pd.read_sql_query(query_revenue_per_region, conn)
df2

            Region  TotalRevenue
0              USA        523.06
1           Canada        303.96
2           France        195.10
3           Brazil        190.10
4          Germany        156.48
5   United Kingdom        112.86
6   Czech Republic         90.24
7         Portugal         77.24
8            India         75.26
9            Chile         46.62
10         Ireland         45.62
11         Hungary         45.62
12         Austria         42.62
13         Finland         41.62
14     Netherlands         40.62
15          Norway         39.62
16          Sweden         38.62
17          Poland         37.62
18           Italy         37.62
19         Denmark         37.62
20       Australia         37.62
21       Argentina         37.62
22           Spain         37.62
23         Belgium         37.62

## 3. Monthly Performance
We analyze sales performance by month to see trends over time.

In [4]:
query_monthly_performance = """
SELECT strftime('%Y-%m', InvoiceDate) AS Month, SUM(Total) AS MonthlyRevenue
FROM Invoice
GROUP BY Month
ORDER BY Month;
"""
df3 = pd.read_sql_query(query_monthly_performance, conn)
df3

      Month  MonthlyRevenue
0   2009-01           35.64
1   2009-02           37.62
2   2009-03           37.62
3   2009-04           37.62
4   2009-05           37.62
5   2009-06           37.62
6   2009-07           37.62
7   2009-08           37.62
8   2009-09           37.62
9   2009-10           37.62
10  2009-11           37.62
11  2009-12           37.62
12  2010-01           52.62
13  2010-02           46.62
14  2010-03           44.62
15  2010-04           37.62
16  2010-05           37.62
17  2010-06           37.62
18  2010-07           37.62
19  2010-08           37.62
20  2010-09           36.63
21  2010-10           37.62
22  2010-11           37.62
23  2010-12           37.62
24  2011-01           37.62
25  2011-02           37.62
26  2011-03           37.62
27  2011-04           51.62
28  2011-05           42.62
29  2011-06           50.62
30  2011-07           37.62
31  2011-08           37.62
32  2011-09           37.62
33  2011-10           37.62
34  2011-11           23.76
35  2011-12           37.62
36  2012-01           37.62
37  2012-02           37.62
38  2012-03           37.62
39  2012-04           37.62
40  2012-05           37.62
41  2012-06           37.62
42  2012-07           39.62
43  2012-08           47.62
44  2012-09           46.71
45  2012-10           42.62
46  2012-11           37.62
47  2012-12           37.62
48  2013-01           37.62
49  2013-02           27.72
50  2013-03           37.62
51  2013-04           33.66
52  2013-05           37.62
53  2013-06           37.62
54  2013-07           37.62
55  2013-08           37.62
56  2013-09           37.62
57  2013-10           37.62
58  2013-11           49.62
59  2013-12           38.62

## 4. Bonus: Ranking Products Using a Window Function
We use the SQL `RANK()` window function to rank products by total units sold.

In [5]:
query_rank = """
SELECT Track, TotalSold, RANK() OVER (ORDER BY TotalSold DESC) AS Rank
FROM (
    SELECT t.Name AS Track, SUM(ivl.Quantity) AS TotalSold
    FROM InvoiceLine ivl
    JOIN Track t ON ivl.TrackId = t.TrackId
    GROUP BY t.Name
);
"""
df4 = pd.read_sql_query(query_rank, conn)
df4

                                                Track  TotalSold  Rank
0                                         The Trooper          5     1
1                                            Eruption          4     2
2                                Hallowed Be Thy Name          4     2
3                                 Sure Know Something          4     2
4                             The Number Of The Beast          4     2
...                                               ...        ...   ...
1883                                      Água E Fogo          1   321
1884                                    Água de Beber          1   321
1885                                           É Fogo          1   321
1886  Étude 1, In C Major - Preludio (Presto) - Liszt          1   321
1887                                           Óculos          1   321

[1888 rows x 3 columns]

## Closing the Connection

In [6]:
conn.close()